# Seção 2: Join

A cláusula SQL Join é usada para combinar registros de duas ou mais tabelas em um banco de dados. Um JOIN é um meio de combinar campos de duas tabelas usando valores comuns a cada uma.

In [2]:
import pyodbc
import pandas as pd

In [3]:
# Some other example server values are
# server = 'localhost\sqlexpress' # for a named instance
# server = 'myserver,port' # to specify an alternate port
server = 'localhost,1433'
database = 'AdventureWorks2017'
username = 'yyyyyyy' # Usuário 
password = '{xxxxxxx}' #Password 
driver = "{ODBC Driver 17 for SQL Server}"

conn_string = f"""
            DRIVER={driver};
            SERVER={server};
            DATABASE={database};
            UID={username};
            PWD={password}
            """
conn = pyodbc.connect(conn_string)

## Inner Join

A mais importante e frequentemente usada das junções é a INNER JOIN. Eles também são chamados de EQUIJOIN.

O INNER JOIN cria uma nova tabela de resultados combinando valores de coluna de duas tabelas (tabela1 e tabela2) com base no predicado de junção. A consulta compara cada linha da tabela1 com cada linha da tabela2 para encontrar todos os pares de linhas que satisfazem o predicado de junção. Quando o predicado de junção é satisfeito, os valores da coluna para cada par correspondente de linhas de A e B são combinados em uma linha de resultado.

Sintaxe

SELECT table1.column1, table2.column2...

FROM table1

INNER JOIN table2

ON table1.common_field = table2.common_field

In [4]:
query = """
        SELECT TOP 4 *
        FROM Person.Person;
        """
pd.read_sql(query, conn)

,BusinessEntityID,PersonType,NameStyle,Title,FirstName,MiddleName,LastName,Suffix,EmailPromotion,AdditionalContactInfo,Demographics,rowguid,ModifiedDate
0,1,EM,False,None,Ken,J,Sánchez,None,0,None,"<IndividualSurvey xmlns=""http://schemas.micros...",92C4279F-1207-48A3-8448-4636514EB7E2,2009-01-07
1,2,EM,False,None,Terri,Lee,Duffy,None,1,None,"<IndividualSurvey xmlns=""http://schemas.micros...",D8763459-8AA8-47CC-AFF7-C9079AF79033,2008-01-24
2,3,EM,False,None,Roberto,None,Tamburello,None,0,None,"<IndividualSurvey xmlns=""http://schemas.micros...",E1A2555E-0828-434B-A33B-6F38136A37DE,2007-11-04
3,4,EM,False,None,Rob,None,Walters,None,0,None,"<IndividualSurvey xmlns=""http://schemas.micros...",F2D7CE06-38B3-4357-805B-F4B6B71C01FF,2007-11-28

In [5]:
query = """
        SELECT TOP 4 *
        FROM  Person.EmailAddress;
        """
pd.read_sql(query, conn)

,BusinessEntityID,EmailAddressID,EmailAddress,rowguid,ModifiedDate
0,1,1,ken0@adventure-works.com,8A1901E4-671B-431A-871C-EADB2942E9EE,2009-01-07
1,2,2,terri0@adventure-works.com,B5FF9EFD-72A2-4F87-830B-F338FDD4D162,2008-01-24
2,3,3,roberto0@adventure-works.com,C8A51084-1C03-4C58-A8B3-55854AE7C499,2007-11-04
3,4,4,rob0@adventure-works.com,17703ED1-0031-4B4A-AFD2-77487A556B3B,2007-11-28

In [6]:
query = """
        SELECT p.BusinessEntityID, p.FirstName, p.LastName, pe.EmailAddress
        FROM Person.Person AS P
        INNER JOIN Person.EmailAddress PE ON P.BusinessEntityID = PE.BusinessEntityID
        """
pd.read_sql(query, conn)

,BusinessEntityID,FirstName,LastName,EmailAddress
0,285,Syed,Abbas,syed0@adventure-works.com
1,293,Catherine,Abel,catherine0@adventure-works.com
2,295,Kim,Abercrombie,kim2@adventure-works.com
3,2170,Kim,Abercrombie,kim7@adventure-works.com
4,38,Kim,Abercrombie,kim1@adventure-works.com
...,...,...,...,...
19967,2087,Patricia,Zubaty,patricia3@adventure-works.com
19968,2088,Judy,Zugelder,judy4@adventure-works.com
19969,12079,Jake,Zukowski,jake22@adventure-works.com
19970,64,Michael,Zwilling,michael7@adventure-works.com
19971,2089,Michael,Zwilling,michael28@adventure-works.com

### Desafio 1 

Retorne uma tabela com as colunas: BusinessEntityId, Name, PhoneNumberTypeId, PhoneNumber.

In [7]:
query = """
        SELECT PP.BusinessEntityID, PN.Name, PP.PhoneNumberTypeID, PP.PhoneNumber
        FROM Person.PersonPhone AS PP
        INNER JOIN Person.PhoneNumberType PN ON PP.PhoneNumberTypeID = PN.PhoneNumberTypeID
        """
pd.read_sql(query, conn)

       BusinessEntityID  Name  PhoneNumberTypeID          PhoneNumber
0                  1959  Work                  3  1 (11) 500 555-0110
1                  2409  Cell                  1  1 (11) 500 555-0110
2                  2467  Home                  2  1 (11) 500 555-0110
3                  2488  Cell                  1  1 (11) 500 555-0110
4                  2510  Home                  2  1 (11) 500 555-0110
...                 ...   ...                ...                  ...
19967             14512  Home                  2         999-555-0149
19968             13828  Cell                  1         999-555-0152
19969                93  Work                  3         999-555-0155
19970              6854  Cell                  1         999-555-0183
19971              6846  Home                  2         999-555-0198

[19972 rows x 4 columns]

### Desafio 2 

Retorne uma tabela com as colunas: AdressId, City, StateProvinceId, Nome do Estado.

In [8]:
query = """
        SELECT PA.AddressID, PA.City, PA.StateProvinceID, PS.Name
        FROM Person.Address PA
        INNER JOIN Person.StateProvince PS ON PA.StateProvinceID = PS.StateProvinceID
        """
pd.read_sql(query, conn)

       AddressID                  City  StateProvinceID                 Name
0            532                Ottawa               57              Ontario
1            497               Burnaby                7     British Columbia
2          29781             Dunkerque              145                 Nord
3          24231  Verrieres Le Buisson              177              Essonne
4          19637  Verrieres Le Buisson              177              Essonne
...          ...                   ...              ...                  ...
19609      19731                Berlin               19               Hessen
19610      15768           Neunkirchen               70             Saarland
19611      17393             Paderborn               20              Hamburg
19612      29769                Berlin               20              Hamburg
19613      18050               München               53  Nordrhein-Westfalen

[19614 rows x 4 columns]

## Tipos de Joins

![](./images/sql-joins.jpg)

### INNER JOIN

Seleciona registros que possuem valores correspondentes em ambas as tabelas.

### LEFT JOIN

Retorna todos os registros da tabela esquerda (tabela1) e os registros correspondentes da tabela direita (tabela2). O resultado é 0 registros do lado direito, se não houver correspondência.

Sintaxe 

SELECT column_name(s)

FROM table1

LEFT JOIN table2

ON table1.column_name = table2.column_name;

### RIGHT JOIN

Retorna todos os registros da tabela direita (tabela2) e os registros correspondentes da tabela esquerda (tabela1). O resultado é 0 registros do lado esquerdo, se não houver correspondência.

Sintaxe

SELECT column_name(s)

FROM table1

RIGHT JOIN table2

ON table1.column_name = table2.column_name;

### FULL OUTER JOIN

Retorna todos os registros quando há uma correspondência nos registros da tabela esquerda (tabela1) ou direita (tabela2).

Sintaxe 

SELECT column_name(s)

FROM table1

FULL OUTER JOIN table2

ON table1.column_name = table2.column_name

WHERE condition;

## Outer Joins/Left Join

Descobrir quais pessoas têm o cartão de crédito registrado.

In [9]:
query = """
        SELECT *
        FROM Person.Person PP
        INNER JOIN Sales.PersonCreditCard SP ON PP.BusinessEntityID = SP.BusinessEntityID

        """
pd.read_sql(query, conn)

,BusinessEntityID,PersonType,NameStyle,Title,FirstName,MiddleName,LastName,Suffix,EmailPromotion,AdditionalContactInfo,Demographics,rowguid,ModifiedDate,BusinessEntityID,CreditCardID,ModifiedDate
0,293,SC,False,Ms.,Catherine,R.,Abel,None,1,"<AdditionalContactInfo xmlns=""http://schemas.m...","<IndividualSurvey xmlns=""http://schemas.micros...",D54E0552-C226-4C22-AF3B-762CA854CDD3,2015-04-15 16:33:33.077,293,17038,2013-07-31
1,295,SC,False,Ms.,Kim,None,Abercrombie,None,0,"<AdditionalContactInfo xmlns=""http://schemas.m...","<IndividualSurvey xmlns=""http://schemas.micros...",F7CBDB48-0B44-470E-9F37-7060446FBFB9,2015-04-15 16:33:33.077,295,15369,2011-08-01
2,297,SC,False,Sr.,Humberto,None,Acevedo,None,2,"<AdditionalContactInfo xmlns=""http://schemas.m...","<IndividualSurvey xmlns=""http://schemas.micros...",5A41D336-84CF-44D7-B12B-83B64B511F7E,2015-04-15 16:33:33.090,297,8010,2011-08-01
3,299,SC,False,Sra.,Pilar,None,Ackerman,None,0,"<AdditionalContactInfo xmlns=""http://schemas.m...","<IndividualSurvey xmlns=""http://schemas.micros...",DF1FB8AB-2323-4330-9AB8-54E13CE6D8F9,2015-04-15 16:33:33.090,299,5316,2013-07-31
4,301,SC,False,Ms.,Frances,B.,Adams,None,1,"<AdditionalContactInfo xmlns=""http://schemas.m...","<IndividualSurvey xmlns=""http://schemas.micros...",66980082-C186-40AE-972A-74560E78C1AF,2015-04-15 16:33:33.090,301,6653,2011-05-31
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
19113,20773,IN,False,None,Crystal,None,Guo,None,0,None,"<IndividualSurvey xmlns=""http://schemas.micros...",D0A499A2-C258-43E9-AB06-F61543A71134,2014-03-19 00:00:00.000,20773,16305,2014-03-19
19114,20774,IN,False,None,Isabella,F,Richardson,None,2,None,"<IndividualSurvey xmlns=""http://schemas.micros...",A4F7F248-82F3-43D5-B5A3-8BD1CB610254,2013-07-29 00:00:00.000,20774,16309,2013-07-29
19115,20775,IN,False,None,Crystal,S,He,None,0,None,"<IndividualSurvey xmlns=""http://schemas.micros...",CD0B82D0-3409-4497-A65F-A68E75EE26CB,2014-03-12 00:00:00.000,20775,16317,2014-03-12
19116,20776,IN,False,None,Crystal,None,Zheng,None,1,None,"<IndividualSurvey xmlns=""http://schemas.micros...",386E35E8-97B3-43E4-9B5F-9594C2FF5CEA,2014-01-14 00:00:00.000,20776,16347,2014-01-14
19117,20777,IN,False,None,Crystal,None,Hu,None,0,None,"<IndividualSurvey xmlns=""http://schemas.micros...",1773C8F3-2CC7-4826-A7F5-30D3F36543CD,2013-10-16 00:00:00.000,20777,16363,2013-10-16

In [10]:
query = """
        SELECT *
        FROM Person.Person PP
        LEFT JOIN Sales.PersonCreditCard SP ON PP.BusinessEntityID = SP.BusinessEntityID

        """
pd.read_sql(query, conn)

,BusinessEntityID,PersonType,NameStyle,Title,FirstName,MiddleName,LastName,Suffix,EmailPromotion,AdditionalContactInfo,Demographics,rowguid,ModifiedDate,BusinessEntityID,CreditCardID,ModifiedDate
0,1,EM,False,None,Ken,J,Sánchez,None,0,None,"<IndividualSurvey xmlns=""http://schemas.micros...",92C4279F-1207-48A3-8448-4636514EB7E2,2009-01-07,NaN,NaN,NaT
1,2,EM,False,None,Terri,Lee,Duffy,None,1,None,"<IndividualSurvey xmlns=""http://schemas.micros...",D8763459-8AA8-47CC-AFF7-C9079AF79033,2008-01-24,NaN,NaN,NaT
2,3,EM,False,None,Roberto,None,Tamburello,None,0,None,"<IndividualSurvey xmlns=""http://schemas.micros...",E1A2555E-0828-434B-A33B-6F38136A37DE,2007-11-04,NaN,NaN,NaT
3,4,EM,False,None,Rob,None,Walters,None,0,None,"<IndividualSurvey xmlns=""http://schemas.micros...",F2D7CE06-38B3-4357-805B-F4B6B71C01FF,2007-11-28,NaN,NaN,NaT
4,5,EM,False,Ms.,Gail,A,Erickson,None,0,None,"<IndividualSurvey xmlns=""http://schemas.micros...",F3A3F6B4-AE3B-430C-A754-9F2231BA6FEF,2007-12-30,NaN,NaN,NaT
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
19967,20773,IN,False,None,Crystal,None,Guo,None,0,None,"<IndividualSurvey xmlns=""http://schemas.micros...",D0A499A2-C258-43E9-AB06-F61543A71134,2014-03-19,20773.0,16305.0,2014-03-19
19968,20774,IN,False,None,Isabella,F,Richardson,None,2,None,"<IndividualSurvey xmlns=""http://schemas.micros...",A4F7F248-82F3-43D5-B5A3-8BD1CB610254,2013-07-29,20774.0,16309.0,2013-07-29
19969,20775,IN,False,None,Crystal,S,He,None,0,None,"<IndividualSurvey xmlns=""http://schemas.micros...",CD0B82D0-3409-4497-A65F-A68E75EE26CB,2014-03-12,20775.0,16317.0,2014-03-12
19970,20776,IN,False,None,Crystal,None,Zheng,None,1,None,"<IndividualSurvey xmlns=""http://schemas.micros...",386E35E8-97B3-43E4-9B5F-9594C2FF5CEA,2014-01-14,20776.0,16347.0,2014-01-14
19971,20777,IN,False,None,Crystal,None,Hu,None,0,None,"<IndividualSurvey xmlns=""http://schemas.micros...",1773C8F3-2CC7-4826-A7F5-30D3F36543CD,2013-10-16,20777.0,16363.0,2013-10-16

In [11]:
query = """
        SELECT 19972 - 19118
        """
pd.read_sql(query, conn)

0  854

In [12]:
query = """
        SELECT *
        FROM Person.Person PP
        LEFT JOIN Sales.PersonCreditCard SP ON PP.BusinessEntityID = SP.BusinessEntityID
        WHERE SP.BusinessEntityID IS NULL
        """
pd.read_sql(query, conn)

,BusinessEntityID,PersonType,NameStyle,Title,FirstName,MiddleName,LastName,Suffix,EmailPromotion,AdditionalContactInfo,Demographics,rowguid,ModifiedDate,BusinessEntityID,CreditCardID,ModifiedDate
0,1,EM,False,None,Ken,J,Sánchez,None,0,None,"<IndividualSurvey xmlns=""http://schemas.micros...",92C4279F-1207-48A3-8448-4636514EB7E2,2009-01-07,None,None,None
1,2,EM,False,None,Terri,Lee,Duffy,None,1,None,"<IndividualSurvey xmlns=""http://schemas.micros...",D8763459-8AA8-47CC-AFF7-C9079AF79033,2008-01-24,None,None,None
2,3,EM,False,None,Roberto,None,Tamburello,None,0,None,"<IndividualSurvey xmlns=""http://schemas.micros...",E1A2555E-0828-434B-A33B-6F38136A37DE,2007-11-04,None,None,None
3,4,EM,False,None,Rob,None,Walters,None,0,None,"<IndividualSurvey xmlns=""http://schemas.micros...",F2D7CE06-38B3-4357-805B-F4B6B71C01FF,2007-11-28,None,None,None
4,5,EM,False,Ms.,Gail,A,Erickson,None,0,None,"<IndividualSurvey xmlns=""http://schemas.micros...",F3A3F6B4-AE3B-430C-A754-9F2231BA6FEF,2007-12-30,None,None,None
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
849,2375,GC,False,None,Michael,None,Allen,None,2,None,"<IndividualSurvey xmlns=""http://schemas.micros...",F4C2287D-CE25-4D6A-9D8E-B97D99985DE3,2009-01-07,None,None,None
850,2376,GC,False,None,Claire,None,O'Donnell,None,2,None,"<IndividualSurvey xmlns=""http://schemas.micros...",740DA540-8310-47B4-A384-D08892AD08BE,2009-01-24,None,None,None
851,2377,GC,False,None,Susan,None,Metters,None,0,None,"<IndividualSurvey xmlns=""http://schemas.micros...",E0D9B655-6A6F-4DB5-9BEE-4596ED1ED596,2012-09-23,None,None,None
852,2378,GC,False,None,Sue,None,Brown,None,0,None,"<IndividualSurvey xmlns=""http://schemas.micros...",DF18290B-86BC-4796-B0B7-146FB96811AB,2009-04-26,None,None,None
853,2379,GC,False,None,Ben,None,Hurt,None,0,None,"<IndividualSurvey xmlns=""http://schemas.micros...",817C7199-7974-43C3-86B6-DB4C6633E39D,2007-11-28,None,None,None

## Union

O UNION operador é usado para combinar o conjunto de resultados de duas ou mais SELECT instruções.

Sintaxe

SELECT column_name(s) FROM table1

UNION

SELECT column_name(s) FROM table2;

In [13]:
query = """
        SELECT ProductID, Name, ProductNumber
        FROM Production.Product
        WHERE Name LIKE '%chain%'
        UNION
        SELECT ProductID, Name, ProductNumber
        FROM Production.Product
        WHERE Name LIKE '%decal%';
        """
pd.read_sql(query, conn)

   ProductID             Name ProductNumber
0        320  Chainring Bolts       CB-2903
1        321    Chainring Nut       CN-6137
2        322        Chainring       CR-7833
3        324      Chain Stays       CS-2812
4        325          Decal 1       DC-8732
5        326          Decal 2       DC-9824
6        952            Chain       CH-0234

In [14]:
query = """
        SELECT FirstName, Title, MiddleName
        FROM Person.Person
        WHERE Title = 'Mr.'
        UNION
        SELECT FirstName, Title, MiddleName
        FROM Person.Person
        WHERE MiddleName = 'A'
        """
pd.read_sql(query, conn)

     FirstName Title MiddleName
0        Aaron  None          A
1        Aaron   Mr.       None
2         Abby  None          A
3          Abe   Mr.         M.
4      Abigail  None          A
..         ...   ...        ...
931  Yao-Qiang   Mr.       None
932    Yolanda  None          A
933    Zachary  None          A
934      Zheng   Mr.       None
935        Zoe  None          A

[936 rows x 3 columns]

## Bancos de dados de exemplo Northwind

https://github.com/microsoft/sql-server-samples/tree/master/samples/databases/northwind-pubs

https://raw.githubusercontent.com/microsoft/sql-server-samples/master/samples/databases/northwind-pubs/instnwnd.sql

## Self Join

O SQL SELF JOIN é usado para unir uma tabela a si mesma como se a tabela fosse duas tabelas; renomeando temporariamente pelo menos uma tabela na instrução SQL.

Sintaxe

SELECT a.column_name, b.column_name...

FROM table1 a, table1 b

WHERE a.common_field = b.common_field;

In [15]:
# Some other example server values are
# server = 'localhost\sqlexpress' # for a named instance
# server = 'myserver,port' # to specify an alternate port
server = 'localhost,1433'
database = 'Northwind'
username = 'yyyyyyy' # Usuário
password = '{xxxxxxx}' #Password
driver = "{ODBC Driver 17 for SQL Server}"

conn_string2 = f"""
            DRIVER={driver};
            SERVER={server};
            DATABASE={database};
            UID={username};
            PWD={password}
            """
conn2 = pyodbc.connect(conn_string2)

Todos os clientes que moram na mesma região.

In [16]:
query = """
        SELECT A.ContactName, A.Region, B.ContactName, B.Region
        FROM Customers A, Customers B
        WHERE A.Region = B.Region
        """
pd.read_sql(query, conn2)

          ContactName Region        ContactName Region
0   Elizabeth Lincoln     BC  Elizabeth Lincoln     BC
1   Elizabeth Lincoln     BC    Yoshi Tannamuri     BC
2        Pedro Afonso     SP       Pedro Afonso     SP
3        Pedro Afonso     SP          Aria Cruz     SP
4        Pedro Afonso     SP      André Fonseca     SP
..                ...    ...                ...    ...
82      Paula Parente     SP  Anabela Domingues     SP
83      Paula Parente     SP      Paula Parente     SP
84     Karl Jablonski     WA         John Steel     WA
85     Karl Jablonski     WA     Helvetius Nagy     WA
86     Karl Jablonski     WA     Karl Jablonski     WA

[87 rows x 4 columns]

Encontrar (nome e data de contratação) de todos os funcionários que foram contratados no mesmo ano.

In [17]:
query = """
        SELECT A.FirstName, A.HireDate, B.FirstName, B.HireDate
        FROM Employees A, Employees B
        WHERE DATEPART(YEAR,A.HireDate) = DATEPART(YEAR,B.HireDate)
        """
pd.read_sql(query, conn2)

   FirstName   HireDate FirstName   HireDate
0      Nancy 1992-05-01     Nancy 1992-05-01
1     Andrew 1992-08-14     Nancy 1992-05-01
2      Janet 1992-04-01     Nancy 1992-05-01
3      Nancy 1992-05-01    Andrew 1992-08-14
4     Andrew 1992-08-14    Andrew 1992-08-14
5      Janet 1992-04-01    Andrew 1992-08-14
6      Nancy 1992-05-01     Janet 1992-04-01
7     Andrew 1992-08-14     Janet 1992-04-01
8      Janet 1992-04-01     Janet 1992-04-01
9   Margaret 1993-05-03  Margaret 1993-05-03
10    Steven 1993-10-17  Margaret 1993-05-03
11   Michael 1993-10-17  Margaret 1993-05-03
12  Margaret 1993-05-03    Steven 1993-10-17
13    Steven 1993-10-17    Steven 1993-10-17
14   Michael 1993-10-17    Steven 1993-10-17
15  Margaret 1993-05-03   Michael 1993-10-17
16    Steven 1993-10-17   Michael 1993-10-17
17   Michael 1993-10-17   Michael 1993-10-17
18    Robert 1994-01-02    Robert 1994-01-02
19     Laura 1994-03-05    Robert 1994-01-02
20      Anne 1994-11-15    Robert 1994-01-02
21    Robert 1994-01-02     Laura 1994-03-05
22     Laura 1994-03-05     Laura 1994-03-05
23      Anne 1994-11-15     Laura 1994-03-05
24    Robert 1994-01-02      Anne 1994-11-15
25     Laura 1994-03-05      Anne 1994-11-15
26      Anne 1994-11-15      Anne 1994-11-15

### Desafio 1

Na tabela detalhe de pedido, quais produtos têm o mesmo percentual de desconto.

In [18]:
query = """
        SELECT A.ProductID, A.Discount, B.ProductID, B.Discount
        FROM [Order Details] A, [Order Details] B
        WHERE A.Discount = B.Discount
        """
pd.read_sql(query, conn2)

         ProductID  Discount  ProductID  Discount
0               11      0.00         11      0.00
1               42      0.00         11      0.00
2               72      0.00         11      0.00
3               14      0.00         11      0.00
4               51      0.00         11      0.00
...            ...       ...        ...       ...
1872940          6      0.25         54      0.25
1872941         14      0.25         54      0.25
1872942         19      0.25         54      0.25
1872943         30      0.25         54      0.25
1872944         54      0.25         54      0.25

[1872945 rows x 4 columns]

## Subquery

Uma consulta subconsulta ou interna ou uma consulta aninhada é uma consulta dentro de outra consulta SQL e incorporada na cláusula WHERE.

Uma subconsulta é usada para retornar dados que serão usados ​​na consulta principal como uma condição para restringir ainda mais os dados a serem recuperados.

Sintaxe

SELECT column_name , column_name 

FROM   table1 , table2 

WHERE  column_name OPERATOR

   (SELECT column_name , column_name 

   FROM table1 , table2 
   
   WHERE)

Monte um relatório de todos os produtos cadastrados que tem preço de venda acima da média.

In [19]:
query = """
        SELECT *
        FROM Production.product
        WHERE ListPrice > (SELECT AVG(ListPrice)FROM Production.Product)
        """
pd.read_sql(query, conn)

,ProductID,Name,ProductNumber,MakeFlag,FinishedGoodsFlag,Color,SafetyStockLevel,ReorderPoint,StandardCost,ListPrice,...,ProductLine,Class,Style,ProductSubcategoryID,ProductModelID,SellStartDate,SellEndDate,DiscontinuedDate,rowguid,ModifiedDate
0,680,"HL Road Frame - Black, 58",FR-R92B-58,True,True,Black,500,375,1059.3100,1431.50,...,R,H,U,14,6,2008-04-30,NaT,None,43DD68D6-14A4-461F-9069-55309D90EA7E,2014-02-08 10:01:36.827
1,706,"HL Road Frame - Red, 58",FR-R92R-58,True,True,Red,500,375,1059.3100,1431.50,...,R,H,U,14,6,2008-04-30,NaT,None,9540FF17-2712-4C90-A3D1-8CE5568B2462,2014-02-08 10:01:36.827
2,717,"HL Road Frame - Red, 62",FR-R92R-62,True,True,Red,500,375,868.6342,1431.50,...,R,H,U,14,6,2011-05-31,NaT,None,052E4F8B-0A2A-46B2-9F42-10FEBCFAE416,2014-02-08 10:01:36.827
3,718,"HL Road Frame - Red, 44",FR-R92R-44,True,True,Red,500,375,868.6342,1431.50,...,R,H,U,14,6,2011-05-31,NaT,None,A88D3B54-2CAE-43F2-8C6E-EA1D97B46A7C,2014-02-08 10:01:36.827
4,719,"HL Road Frame - Red, 48",FR-R92R-48,True,True,Red,500,375,868.6342,1431.50,...,R,H,U,14,6,2011-05-31,NaT,None,07BEFC9A-7634-402B-B234-D7797733BAAF,2014-02-08 10:01:36.827
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
131,992,"Mountain-500 Black, 48",BK-M18B-48,True,True,Black,100,75,294.5797,539.99,...,M,L,U,1,23,2013-05-30,NaT,None,75752E26-A3B6-4264-9B06-F23A4FBDC5A7,2014-02-08 10:01:36.827
132,993,"Mountain-500 Black, 52",BK-M18B-52,True,True,Black,100,75,294.5797,539.99,...,M,L,U,1,23,2013-05-30,NaT,None,69EE3B55-E142-4E4F-AED8-AF02978FBE87,2014-02-08 10:01:36.827
133,997,"Road-750 Black, 44",BK-R19B-44,True,True,Black,100,75,343.6496,539.99,...,R,L,U,2,31,2013-05-30,NaT,None,44CE4802-409F-43AB-9B27-CA53421805BE,2014-02-08 10:01:36.827
134,998,"Road-750 Black, 48",BK-R19B-48,True,True,Black,100,75,343.6496,539.99,...,R,L,U,2,31,2013-05-30,NaT,None,3DE9A212-1D49-40B6-B10A-F564D981DBDE,2014-02-08 10:01:36.827
135,999,"Road-750 Black, 52",BK-R19B-52,True,True,Black,100,75,343.6496,539.99,...,R,L,U,2,31,2013-05-30,NaT,None,AE638923-2B67-4679-B90E-ABBAB17DCA31,2014-02-08 10:01:36.827

O nome dos funcionários que tem o cargo de "Design Engineer".

In [20]:
query = """
        SELECT FirstName
        FROM Person.Person
        WHERE BusinessEntityID IN (
            SELECT BusinessEntityID
            FROM HumanResources.Employee
            WHERE JobTitle = 'Design Engineer'
            )
        """
pd.read_sql(query, conn)

  FirstName
0      Gail
1    Jossef
2    Sharon

Usando Join

In [21]:
query = """
        SELECT FirstName
        FROM Person.Person P
        INNER JOIN HumanResources.Employee E ON P.BusinessEntityID = E.BusinessEntityID
        AND E.JobTitle = 'Design Engineer'
        """
pd.read_sql(query, conn)

  FirstName
0      Gail
1    Jossef
2    Sharon

### Desafio 1
Encontre todos os endereços que estão no estado de 'Alberta', pode trazer todas as informações.

In [22]:
query = """
        SELECT AddressID, AddressLine1
        FROM AdventureWorks2017.Person.Address
        WHERE StateProvinceID IN (
            SELECT StateProvinceID
            FROM AdventureWorks2017.Person.StateProvince
            WHERE Name = 'Alberta'
        )
        """
pd.read_sql(query, conn)

    AddressID                             AddressLine1
0          33                       10203 Acorn Avenue
1       20011                      1273 Deetmeadow Way
2       16208                          1936 Balance Ct
3         519                      2500-622 5th Ave Sw
4         546              250333 Southport Road, S.W.
5         475                   2512-410th Avenue S.W.
6         451                          2512-4th Ave Sw
7         526                     251420a 170th Street
8         553  253131 Lake Frasier Drive, Office No. 2
9         467                   25900-700-9th Ave S.W.
10      22266                        3962 Clyde Street
11      19745                    4605 Springvale Court
12      15731                        4900 La Salle St.
13      13528                 5831 Mountain View Place
14      21858                      5860 Rock Creek Pl.
15      20116                         6155 Vist Oak Dr
16      12827                        6350 Plumas Court
17        505                   6400, 888 - 3rd Avenue
18        466                         655-4th Ave S.W.
19        558       67255 - 8th Street N.E., Suite 350
20      13975                           6827 Glaze Dr.
21      21055                      8892 Oak Grove Road
22        487                  9259 - 1110th Avenue Sw
23        502            No. 25400 10665 Jasper Avenue
24        504      Suite 99320 255 - 510th Avenue S.W.